# SetNamingRule Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..SetNamingRule Method
PDFExportOptions Class See Also
---
Sets the naming rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
```

Visual Basic
---
```text
Public Sub SetNamingRule ( _
	namingRule As IList(Of TableCellCombinedParameterData) _
)
```

Visual C++
---
```text
public:
void SetNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
```

# ### Parameters
namingRule
    Type: System.Collections.Generic..::..IList<(Of <(<'TableCellCombinedParameterData>)>)> The naming rule.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The namingRule is empty or contains illegal characters. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace